{
    "basic_info": {
      "description_header": "Software Developer",
      "description": "Hey! I’m DeShon Dixon. A US Army Veteran, I've recently transitioned into software development. The languages I utilize the most are JavaScript and Python. What I bring to a team is that I’m very coachable, eager to learn, and easy to work with. I’ve always worked jobs that involve me finding solutions for customer needs and have a strong passion for problem solving. I’ve worked in sales, video editing, and as a mechanic in the army and they have always been favored because I listen with empathy and ensure expectations are met. I’m able to hold my own because I’m willing to listen to advice. I love to hear opinions on how I could be more effective. I strive to learn more and handle ambiguity well. I’m self-starting and continually find ways to be productive. I’m a team player and put the greater good of the team before individual gain. I own up to anything I am wrong in. I never make excuses or hide my mistakes. I do what it takes to correct those mistakes and learn from them.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Job Hunter",
        "startDate": "2023",
        "description": "An automated job application tool that uses web scraping to gather job listings from various job websites, uses regex to extract relevant information such as job title, company, and application link, and then uses remote APIs to gather information about the companies and the application process. Built with Python, Rich Library, Cloud Scraper library, Scraping Bee API, Requests, Pyfiglet, Beautifulsoup, Dotenv, Playwright, PyTest",
        "images": [
          "images/portfolio/adventure/100.png",
          "images/portfolio/adventure/101.png",
          "images/portfolio/adventure/102.png",
          "images/portfolio/adventure/103.png",
          "images/portfolio/adventure/104.png",
          "images/portfolio/adventure/105.png"
        ],
        "url": "https://github.com/CodingAcademics/JobHunter",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      },
      {
        "title": "OpenImg",
        "startDate": "2022",
        "description": "OpenImg is a web application that allows users to log into their account and request the creation of an image using artificial intelligence. The application is built using a combination of technologies, including React, Node.js, and Express.js for the frontend and backend development, respectively. Bootstrap is used for the layout and styling of the application, while MongoDB is used as the database to store user information and image requests. CSS3 is used to create custom styles and enhance the visual appearance of the application. To ensure secure authentication, the application uses Auth0 to manage user login and authorization. Once logged in, users can use the Dall-E 2 API to input a prompt and generate an image based on their request. The API uses state-of-the-art machine learning models to generate high-quality images that accurately reflect the user's prompt. OpenImg is a powerful and convenient tool for anyone interested in generating custom images using artificial intelligence. Whether you're a designer looking for inspiration or simply someone who enjoys exploring the creative possibilities of AI, OpenImg has something to offer.",
        "images": [
          "images/portfolio/photography/26.png",
          "images/portfolio/photography/27.png",
          "images/portfolio/photography/28.png",
          "images/portfolio/photography/29.png",
          "images/portfolio/photography/30.png",
          "images/portfolio/photography/31.png"
        ],
        "url": "https://openimg.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
          "class": "devicon-css3-plain",
          "name": "CSS 3"
          }
        ]
      },
      {
        "title": "Gallery of Horns",
        "startDate": "2022",
        "description": "User can view gallery of horned animals as well as 🖤 their favorite ones. There is also a drop down menu that allows the user to search by the amount of horns an animal has to narrow down their search. First, I decided to use React as the framework for my project because of its versatility and ability to efficiently render components. I also used JavaScript and CSS to add interactivity and styling to the project. Next, I began by setting up the basic structure of the app and creating the components that would be necessary, such as the gallery and the drop down menu. I also gathered a list of horned animals and their respective images and information that I wanted to include in the gallery. Once the basic structure was in place, I began implementing the functionality for the drop down menu. This involved adding the search functionality and handling the user's input to filter the gallery accordingly. Next, I focused on styling the app to make it visually appealing and easy to navigate. This involved adding custom CSS styles and ensuring that the layout was responsive and looked good on different devices. Finally, I tested the app thoroughly to ensure that it was functioning correctly and made any necessary adjustments. Once I was satisfied with the result, I deployed the app and made it available for users to view and interact with via netlify.",
        "images": [
          "images/portfolio/photography/15.png",
          "images/portfolio/photography/16.png",
          "images/portfolio/photography/17.png",
          "images/portfolio/photography/18.png"
        ],
        "url": "https://galleryofhornsdd.netlify.app",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
          "class": "devicon-css3-plain",
          "name": "CSS 3"
          }
        ]
      },
      {
        "title": "Pigs and Bulls",
        "startDate": "2022",
        "description": "As a developer, I created a word-guessing game using React, JavaScript, and CSS. The game is similar to Wordle, in which the player is required to guess a 5-letter word. Upon guessing the word, the game will inform the player how many letters are correct (pigs) and how many words are correct and in the correct spot (bulls). I utilized React for the front-end of the game, allowing for a smooth and interactive user experience. The game logic was implemented using JavaScript, and the overall design and styling was achieved through the use of CSS. Overall, it was a great opportunity for me to further enhance my skills in these technologies and create a fun and engaging game for players.",
        "images": [
          "images/portfolio/animal-shelter/12.png",
          "images/portfolio/animal-shelter/13.png"
        ],
        "url": "https://thewordgame.github.io/pigs-and-bulls/",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          }
        ]
      },
      {
        "title": "Snakes Cafe",
        "startDate": "2023",
        "description": "I recently created a command line utility called Snakes Cafe, which is designed to mimic the functionality of a point of sale restaurant system. I used my understanding of Python and various tools to build this utility, which allows users to place orders and view menus. The process of creating Snakes Cafe was an exciting and challenging experience for me. I had to consider various factors such as user experience and efficiency while designing and building the system. I also had to ensure that the system was user-friendly and easy to navigate. Overall, Snakes Cafe is a useful tool for anyone looking to manage a restaurant or food service business. It helps streamline the process of taking orders, making it easier for customers to enjoy their dining experience. I am proud of the work I put into creating this utility, and I hope it will be a valuable resource for others in the industry.",
        "images": [
          "images/portfolio/photography/50.png",
          "images/portfolio/photography/51.png",
          "images/portfolio/photography/52.png"
        ],
        "url": "https://github.com/deshondixon/snakes-cafe",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      },
      {
        "title": "Ten-Thousand",
        "startDate": "2023",
        "description": "Ten-thousand is a fun and exciting dice game that I recently developed using Python programming language. Inspired by the popular game Farkle, Ten-thousand is a thrilling way to pass the time and challenge your friends. The game is played through the command line, making it easy to play on any device with a terminal. Players take turns rolling six dice, trying to score as many points as possible by rolling certain combinations. The goal is to reach a total of 10,000 points before your opponents. Developing Ten-thousand was a fun and rewarding experience for me. I enjoyed designing the game mechanics and implementing them in Python. The process required a lot of trial and error, but it was worth it to see the final product come to life. I hope that Ten-thousand brings as much joy and entertainment to others as it did for me while creating it. Give it a try and see if you have what it takes to be the ultimate Ten-thousand champion!",
        "images": [
          "images/portfolio/photography/40.png",
          "images/portfolio/photography/41.png",
          "images/portfolio/photography/42.png"
        ],
        "url": "https://github.com/deshondixon/ten-thousand",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "United States Army",
        "title": "91B Wheeled Vehicle Mechanic",
        "years": "11/22/2016 - 11/27/2019",
        "mainTech": [
          "11/22/2016 - 11/27/2019"
        ],
        "technologies": [
          "",
          "",
          "",
          "",
          "",
          "",
          ""
        ]
      },
      {
        "company": "Code Fellows",
        "title": "Software Developer",
        "years": "10.2022 - present",
        "mainTech": [
          "Python 10/8/22"
        ],
        "technologies": [
          "REST API",
          "JavaScript",
          "Bootstrap",
          "HTML5",
          "CSS3",
          "Python",
          "React"
        ]
      }
    ]
  }
